#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/YtseJam/canary-rolling/runs/run-vuUTXBUXJF1wAThv

Waiting for the plan to start...

Terraform v1.1.6
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-008e7c0d13e61b473]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-08e6a24037128f5a9]
module.lb_security_group.module.sg.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-0743bd559de13913d]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-016c3f8be3e6af0fa]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-04dc228629f9065e9]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0ae316ca05cb646a1]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-08519d8ad5054efeb]
module.http_80_security_group.module.sg.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-05d37fcfc3ba091a7]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0438c4005fd5431a2]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-0859fbbd4a3275726]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0e5ebe6e03f181b7d]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0a7d51f64abc04eab]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-0a031dd7b8e5fecfb]
module.vpc.aws_route_table.private[2]: Refreshing state... [id=rtb-054bb5aa1c844a2de]
module.lb_security_group.module.sg.aws_security_group_rule.egress_rules[0]: Refreshing state... [id=sgrule-4015336587]
module.lb_security_group.module.sg.aws_security_group_rule.ingress_rules[0]: Refreshing state... [id=sgrule-3010311476]
module.lb_security_group.module.sg.aws_security_group_rule.ingress_with_self[0]: Refreshing state... [id=sgrule-2448335112]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-08519d8ad5054efeb1080289494]
module.http_80_security_group.module.sg.aws_security_group_rule.egress_rules[0]: Refreshing state... [id=sgrule-2511451809]
module.http_80_security_group.module.sg.aws_security_group_rule.ingress_with_self[0]: Refreshing state... [id=sgrule-3018257811]
module.http_80_security_group.module.sg.aws_security_group_rule.ingress_rules[0]: Refreshing state... [id=sgrule-2860397193]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0e57236c539c0bd73]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-050ebd714e1840705]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-018fbf8d7d9f0d4ba]
module.alb.aws_lb.this[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-1:660346824954:loadbalancer/app/alb-canary-rolling-deployment/f12410d8abba83ba]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0f57c8f8e5969a680]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-088896008d3cd4c38]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0f92b39e4703176e4]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.lb_security_group.module.sg.aws_security_group.this_name_prefix[0] has changed
  ~ resource "aws_security_group" "this_name_prefix" {
      ~ egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "All protocols"
              + from_port        = 0
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
        id                     = "sg-0743bd559de13913d"
      ~ ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "HTTP"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
          + {
              + cidr_blocks      = []
              + description      = "Ingress Rule"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = true
              + to_port          = 0
            },
        ]
        name                   = "lb-sg-20220228171858667000000001"
        tags                   = {
            "Name" = "lb-sg"
        }
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.lb_security_group.module.sg.aws_security_group_rule.egress_rules[0] has changed
  ~ resource "aws_security_group_rule" "egress_rules" {
      ~ from_port         = -1 -> 0
        id                = "sgrule-4015336587"
      ~ to_port           = -1 -> 0
        # (8 unchanged attributes hidden)
    }

  # module.lb_security_group.module.sg.aws_security_group_rule.ingress_with_self[0] has changed
  ~ resource "aws_security_group_rule" "ingress_with_self" {
      + cidr_blocks              = []
      ~ from_port                = -1 -> 0
        id                       = "sgrule-2448335112"
      + ipv6_cidr_blocks         = []
      + source_security_group_id = "sg-0743bd559de13913d"
      ~ to_port                  = -1 -> 0
        # (6 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_lb_listener.http will be created
  + resource "aws_lb_listener" "http" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = "arn:aws:elasticloadbalancing:ap-southeast-1:660346824954:loadbalancer/app/alb-canary-rolling-deployment/f12410d8abba83ba"
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # aws_lb_target_group.http will be created
  + resource "aws_lb_target_group" "http" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + name                               = "tg-canary-rolling-deployment"
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = (known after apply)
      + target_type                        = "instance"
      + vpc_id                             = "vpc-008e7c0d13e61b473"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 10
          + matcher             = (known after apply)
          + path                = (known after apply)
          + port                = "80"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 3
        }

      + stickiness {
          + cookie_duration = (known after apply)
          + cookie_name     = (known after apply)
          + enabled         = (known after apply)
          + type            = (known after apply)
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.


```
</details>
*Pusher: @adadeeeh, Action: `pull_request`*